<template>
  <div class="content">
    <dv-border-box-10 class="content_left col-65">
      <div class="content_left_left">
        <div class="big-title">数据共享</div>
        <ve-histogram
          :data="chartData01"
          :extend="chartExtendLine"
          :settings="chartSetting1"
          :textStyle="legend.textStyle"
          height="calc(100% - 40px)"
          :legend="legend"
        ></ve-histogram>
      </div>
      <div class="content_left_right">
        <div class="content_left_right_item">
          <div class="item_title">
            <dv-border-box-8 :reverse="true">数据共享比例</dv-border-box-8>
          </div>

          <ve-pie
            :legend-visible="false"
            height="26vh"
            :data="pieData"
            :extend="chartExtendPie"
            :settings="pieSetting"
          ></ve-pie>
        </div>
        <div class="content_left_right_item">
          <div class="item_title">
            <dv-border-box-8 :reverse="true">数据共享用户分布</dv-border-box-8>
          </div>

          <ve-pie
            :legend-visible="false"
            height="26vh"
            :data="pieUser"
            :extend="chartExtendPie"
            :settings="pieSetting"
          ></ve-pie>
        </div>
      </div>
    </dv-border-box-10>
    <dv-border-box-10 class="content_right col-35" ref="hospital_swiper">
      <div class="content_right_content">
        <div class="tab_content">
          <div style="text-align:center;margin:10px;" class="item_title">数据资源</div>
          <div class="content_item">
            <ve-histogram
              :data="rightData"
              :textStyle="legend.textStyle"
              :legend="legend"
              height="70vh"
              :settings="chartSetting2"
            ></ve-histogram>
          </div>
        </div>
      </div>
    </dv-border-box-10>
  </div>
</template>

<script>
// let moment = require('moment');

export default {
  props: ["chartData01", "pieData", "pieUser", "rightData"],
  data() {
    this.chartExtendLine = {
      grid: {
        top: "10%",
        bottom: "0",
        height: "auto"
      },
      series: {
        center: ["50%", "55%"]
      }
    };
    this.chartExtendPie = {
      grid: {
        top: "10",
        bottom: "0",
        height: "auto"
      },
      series: {
        center: ["50%", "50%"],
        radius: [0, "40%"]
      }
    };
    this.pieSetting = {
      radius: 20,
      offsetY: 160
    };
    this.pieSetting3 = {
      radius: 50,
      offsetY: 120
    };

    return {
      date: null,
      checkDataType: "day",
      legend: {
        textStyle: {
          color: "#fff",
          fontSize: 10
        }
      },
      chartSetting1: {
        stack: { 用户: ["表1", "表2", "表3", "表4", "表5"] }
      },
      chartSetting2: {
        axisSite: { right: ["占用空间"] },
        yAxisType: ["normal", "percent"],
        yAxisName: ["数值", "比率"]
      },
      swiperOptionTop: {
        watchSlidesProgress: true,
        watchSlidesVisibility: true,
        loopedSlides: 5,
        autoplay: {
          delay: 3000,
          disableOnInteraction: false
        }
        //轮播豆豆
        // pagination: {
        //   el: '.swiper-pagination',
        //   clickable: true,
        //   renderBullet(index, className) {
        //     let hospital_name = ['表1', '表2', '表3', '表4', '表5'];
        //     return `<span class="${className} swiper-pagination-bullet-custom">${hospital_name[index]}</span>`;
        //   }
        // }
      },
      pieData1: {
        hospital: {},
        card: {}
      },
      chartData02: {
        // hos1: {},
        // hos2: {},
        // hos3: {},
        // hos4: {},
        // hos5: {}
      },
      hos_bar_data: {
        hos1Data: {
          day: {
            columns: ["表", "数据量", "占用空间"],
            rows: [
              { 表: "表1", 数据量: 1511, 占用空间: 0.45 },
              { 表: "表2", 数据量: 1403, 占用空间: 0.47 },
              { 表: "表3", 数据量: 1421, 占用空间: 0.84 },
              { 表: "表4", 数据量: 1311, 占用空间: 0.49 },
              { 表: "表5", 数据量: 1512, 占用空间: 0.24 }
            ]
          },
          week: {
            columns: ["表", "数据量", "占用空间"],
            rows: [
              { 表: "表1", 数据量: 1150, 占用空间: 0.36 },
              { 表: "表2", 数据量: 1223, 占用空间: 0.56 },
              { 表: "表3", 数据量: 1351, 占用空间: 0.46 },
              { 表: "表4", 数据量: 1156, 占用空间: 0.12 },
              { 表: "表5", 数据量: 2157, 占用空间: 0.39 }
            ]
          },
          month: {
            columns: ["表", "数据量", "占用空间"],
            rows: [
              { 表: "表1", 数据量: 100, 占用空间: 0.45 },
              { 表: "表2", 数据量: 154, 占用空间: 0.47 },
              { 表: "表3", 数据量: 224, 占用空间: 0.84 },
              { 表: "表4", 数据量: 123, 占用空间: 0.49 },
              { 表: "表5", 数据量: 142, 占用空间: 0.24 }
            ]
          },
          year: {
            columns: ["表", "数据量", "占用空间"],
            rows: [
              { 表: "表1", 数据量: 2461, 占用空间: 0.51 },
              { 表: "表2", 数据量: 1654, 占用空间: 0.45 },
              { 表: "表3", 数据量: 1956, 占用空间: 0.52 },
              { 表: "表4", 数据量: 2854, 占用空间: 0.57 },
              { 表: "表5", 数据量: 1136, 占用空间: 0.15 }
            ]
          }
        },
        hos2Data: {
          day: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "00:00", 访问次数: 11 },
              { 时间: "01:00", 访问次数: 23 },
              { 时间: "02:00", 访问次数: 11 },
              { 时间: "03:00", 访问次数: 2 },
              { 时间: "04:00", 访问次数: 55 },
              { 时间: "05:00", 访问次数: 12 },
              { 时间: "06:00", 访问次数: 51 },
              { 时间: "07:00", 访问次数: 1 },
              { 时间: "08:00", 访问次数: 5 },
              { 时间: "09:00", 访问次数: 45 },
              { 时间: "10:00", 访问次数: 22 },
              { 时间: "11:00", 访问次数: 37 },
              { 时间: "12:00", 访问次数: 2 },
              { 时间: "13:00", 访问次数: 19 },
              { 时间: "14:00", 访问次数: 23 },
              { 时间: "15:00", 访问次数: 29 },
              { 时间: "16:00", 访问次数: 24 },
              { 时间: "17:00", 访问次数: 37 },
              { 时间: "18:00", 访问次数: 15 },
              { 时间: "19:00", 访问次数: 26 },
              { 时间: "20:00", 访问次数: 25 },
              { 时间: "21:00", 访问次数: 32 },
              { 时间: "22:00", 访问次数: 54 },
              { 时间: "23:00", 访问次数: 26 }
            ]
          },
          week: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "周一", 访问次数: 124 },
              { 时间: "周二", 访问次数: 551 },
              { 时间: "周三", 访问次数: 467 },
              { 时间: "周四", 访问次数: 421 },
              { 时间: "周五", 访问次数: 214 },
              { 时间: "周六", 访问次数: 375 },
              { 时间: "周日", 访问次数: 568 }
            ]
          },
          month: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1号", 访问次数: 1234 },
              { 时间: "2号", 访问次数: 851 },
              { 时间: "3号", 访问次数: 567 },
              { 时间: "4号", 访问次数: 521 },
              { 时间: "5号", 访问次数: 1014 },
              { 时间: "6号", 访问次数: 975 },
              { 时间: "7号", 访问次数: 468 },
              { 时间: "8号", 访问次数: 365 },
              { 时间: "9号", 访问次数: 289 },
              { 时间: "10号", 访问次数: 593 },
              { 时间: "11号", 访问次数: 547 },
              { 时间: "12号", 访问次数: 206 },
              { 时间: "13号", 访问次数: 620 },
              { 时间: "14号", 访问次数: 97 },
              { 时间: "15号", 访问次数: 92 },
              { 时间: "16号", 访问次数: 23 },
              { 时间: "17号", 访问次数: 256 },
              { 时间: "18号", 访问次数: 392 },
              { 时间: "19号", 访问次数: 14 },
              { 时间: "20号", 访问次数: 236 },
              { 时间: "21号", 访问次数: 45 },
              { 时间: "22号", 访问次数: 301 },
              { 时间: "23号", 访问次数: 214 },
              { 时间: "24号", 访问次数: 106 },
              { 时间: "25号", 访问次数: 124 },
              { 时间: "26号", 访问次数: 551 },
              { 时间: "27号", 访问次数: 567 },
              { 时间: "28号", 访问次数: 451 },
              { 时间: "29号", 访问次数: 204 },
              { 时间: "30号", 访问次数: 475 }
            ]
          },
          year: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1月", 访问次数: 5234 },
              { 时间: "2月", 访问次数: 7851 },
              { 时间: "3月", 访问次数: 3567 },
              { 时间: "4月", 访问次数: 6521 },
              { 时间: "5月", 访问次数: 3014 },
              { 时间: "6月", 访问次数: 9975 },
              { 时间: "7月", 访问次数: 4568 },
              { 时间: "8月", 访问次数: 6065 },
              { 时间: "9月", 访问次数: 8589 },
              { 时间: "10月", 访问次数: 4593 },
              { 时间: "11月", 访问次数: 5547 },
              { 时间: "12月", 访问次数: 7154 }
            ]
          }
        },
        hos3Data: {
          day: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "00:00", 访问次数: 1 },
              { 时间: "01:00", 访问次数: 5 },
              { 时间: "02:00", 访问次数: 4 },
              { 时间: "03:00", 访问次数: 4 },
              { 时间: "04:00", 访问次数: 2 },
              { 时间: "05:00", 访问次数: 4 },
              { 时间: "06:00", 访问次数: 4 },
              { 时间: "07:00", 访问次数: 3 },
              { 时间: "08:00", 访问次数: 2 },
              { 时间: "09:00", 访问次数: 4 },
              { 时间: "10:00", 访问次数: 5 },
              { 时间: "11:00", 访问次数: 7 },
              { 时间: "12:00", 访问次数: 6 },
              { 时间: "13:00", 访问次数: 9 },
              { 时间: "14:00", 访问次数: 1 },
              { 时间: "15:00", 访问次数: 2 },
              { 时间: "16:00", 访问次数: 2 },
              { 时间: "17:00", 访问次数: 3 },
              { 时间: "18:00", 访问次数: 1 },
              { 时间: "19:00", 访问次数: 2 },
              { 时间: "20:00", 访问次数: 4 },
              { 时间: "21:00", 访问次数: 3 },
              { 时间: "22:00", 访问次数: 2 },
              { 时间: "23:00", 访问次数: 1 }
            ]
          },
          week: {
            columns: ["时间", " 访问次数"],
            rows: [
              { 时间: "周一", 访问次数: 154 },
              { 时间: "周二", 访问次数: 551 },
              { 时间: "周三", 访问次数: 457 },
              { 时间: "周四", 访问次数: 451 },
              { 时间: "周五", 访问次数: 254 },
              { 时间: "周六", 访问次数: 455 },
              { 时间: "周日", 访问次数: 458 }
            ]
          },
          month: {
            columns: ["时间", " 访问次数"],
            rows: [
              { 时间: "1号", 访问次数: 234 },
              { 时间: "2号", 访问次数: 851 },
              { 时间: "3号", 访问次数: 567 },
              { 时间: "4号", 访问次数: 521 },
              { 时间: "5号", 访问次数: 14 },
              { 时间: "6号", 访问次数: 975 },
              { 时间: "7号", 访问次数: 568 },
              { 时间: "8号", 访问次数: 65 },
              { 时间: "9号", 访问次数: 589 },
              { 时间: "10号", 访问次数: 593 },
              { 时间: "11号", 访问次数: 547 },
              { 时间: "12号", 访问次数: 14 },
              { 时间: "13号", 访问次数: 520 },
              { 时间: "14号", 访问次数: 87 },
              { 时间: "15号", 访问次数: 982 },
              { 时间: "16号", 访问次数: 923 },
              { 时间: "17号", 访问次数: 456 },
              { 时间: "18号", 访问次数: 792 },
              { 时间: "19号", 访问次数: 514 },
              { 时间: "20号", 访问次数: 436 },
              { 时间: "21号", 访问次数: 125 },
              { 时间: "22号", 访问次数: 201 },
              { 时间: "23号", 访问次数: 514 },
              { 时间: "24号", 访问次数: 26 },
              { 时间: "25号", 访问次数: 234 },
              { 时间: "26号", 访问次数: 851 },
              { 时间: "27号", 访问次数: 567 },
              { 时间: "28号", 访问次数: 521 },
              { 时间: "29号", 访问次数: 14 },
              { 时间: "30号", 访问次数: 975 }
            ]
          },
          year: {
            columns: ["时间", " 访问次数"],
            rows: [
              { 时间: "1月", 访问次数: 1234 },
              { 时间: "2月", 访问次数: 5251 },
              { 时间: "3月", 访问次数: 4267 },
              { 时间: "4月", 访问次数: 4221 },
              { 时间: "5月", 访问次数: 2214 },
              { 时间: "6月", 访问次数: 4275 },
              { 时间: "7月", 访问次数: 4268 },
              { 时间: "8月", 访问次数: 3265 },
              { 时间: "9月", 访问次数: 2289 },
              { 时间: "10月", 访问次数: 4293 },
              { 时间: "11月", 访问次数: 5247 },
              { 时间: "12月", 访问次数: 724 }
            ]
          }
        },
        hos4Data: {
          day: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "00:00", 访问次数: 1234 },
              { 时间: "01:00", 访问次数: 5851 },
              { 时间: "02:00", 访问次数: 4567 },
              { 时间: "03:00", 访问次数: 4521 },
              { 时间: "04:00", 访问次数: 2014 },
              { 时间: "05:00", 访问次数: 4975 },
              { 时间: "06:00", 访问次数: 4568 },
              { 时间: "07:00", 访问次数: 3065 },
              { 时间: "08:00", 访问次数: 2589 },
              { 时间: "09:00", 访问次数: 4593 },
              { 时间: "10:00", 访问次数: 5547 },
              { 时间: "11:00", 访问次数: 714 },
              { 时间: "12:00", 访问次数: 6520 },
              { 时间: "13:00", 访问次数: 987 },
              { 时间: "14:00", 访问次数: 1982 },
              { 时间: "15:00", 访问次数: 2923 },
              { 时间: "16:00", 访问次数: 2456 },
              { 时间: "17:00", 访问次数: 3792 },
              { 时间: "18:00", 访问次数: 1514 },
              { 时间: "19:00", 访问次数: 2436 },
              { 时间: "20:00", 访问次数: 4125 },
              { 时间: "21:00", 访问次数: 3201 },
              { 时间: "22:00", 访问次数: 2514 },
              { 时间: "23:00", 访问次数: 1026 }
            ]
          },
          week: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "周一", 访问次数: 1234 },
              { 时间: "周二", 访问次数: 5851 },
              { 时间: "周三", 访问次数: 4567 },
              { 时间: "周四", 访问次数: 4521 },
              { 时间: "周五", 访问次数: 2014 },
              { 时间: "周六", 访问次数: 4975 },
              { 时间: "周日", 访问次数: 4568 }
            ]
          },
          month: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1号", 访问次数: 1234 },
              { 时间: "2号", 访问次数: 5851 },
              { 时间: "3号", 访问次数: 4567 },
              { 时间: "4号", 访问次数: 4521 },
              { 时间: "5号", 访问次数: 2014 },
              { 时间: "6号", 访问次数: 4975 },
              { 时间: "7号", 访问次数: 4568 },
              { 时间: "8号", 访问次数: 3065 },
              { 时间: "9号", 访问次数: 2589 },
              { 时间: "10号", 访问次数: 4593 },
              { 时间: "11号", 访问次数: 5547 },
              { 时间: "12号", 访问次数: 714 },
              { 时间: "13号", 访问次数: 6520 },
              { 时间: "14号", 访问次数: 987 },
              { 时间: "15号", 访问次数: 1982 },
              { 时间: "16号", 访问次数: 2923 },
              { 时间: "17号", 访问次数: 2456 },
              { 时间: "18号", 访问次数: 3792 },
              { 时间: "19号", 访问次数: 1514 },
              { 时间: "20号", 访问次数: 2436 },
              { 时间: "21号", 访问次数: 4125 },
              { 时间: "22号", 访问次数: 3201 },
              { 时间: "23号", 访问次数: 2514 },
              { 时间: "24号", 访问次数: 1026 },
              { 时间: "25号", 访问次数: 1234 },
              { 时间: "26号", 访问次数: 5851 },
              { 时间: "27号", 访问次数: 4567 },
              { 时间: "28号", 访问次数: 4521 },
              { 时间: "29号", 访问次数: 2014 },
              { 时间: "30号", 访问次数: 4975 }
            ]
          },
          year: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1月", 访问次数: 1234 },
              { 时间: "2月", 访问次数: 5851 },
              { 时间: "3月", 访问次数: 4567 },
              { 时间: "4月", 访问次数: 4521 },
              { 时间: "5月", 访问次数: 2014 },
              { 时间: "6月", 访问次数: 4975 },
              { 时间: "7月", 访问次数: 4568 },
              { 时间: "8月", 访问次数: 3065 },
              { 时间: "9月", 访问次数: 2589 },
              { 时间: "10月", 访问次数: 4593 },
              { 时间: "11月", 访问次数: 5547 },
              { 时间: "12月", 访问次数: 714 }
            ]
          }
        },
        hos5Data: {
          day: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "00:00", 访问次数: 1234 },
              { 时间: "01:00", 访问次数: 5851 },
              { 时间: "02:00", 访问次数: 4567 },
              { 时间: "03:00", 访问次数: 4521 },
              { 时间: "04:00", 访问次数: 2014 },
              { 时间: "05:00", 访问次数: 4975 },
              { 时间: "06:00", 访问次数: 4568 },
              { 时间: "07:00", 访问次数: 3065 },
              { 时间: "08:00", 访问次数: 2589 },
              { 时间: "09:00", 访问次数: 4593 },
              { 时间: "10:00", 访问次数: 5547 },
              { 时间: "11:00", 访问次数: 714 },
              { 时间: "12:00", 访问次数: 6520 },
              { 时间: "13:00", 访问次数: 987 },
              { 时间: "14:00", 访问次数: 1982 },
              { 时间: "15:00", 访问次数: 2923 },
              { 时间: "16:00", 访问次数: 2456 },
              { 时间: "17:00", 访问次数: 3792 },
              { 时间: "18:00", 访问次数: 1514 },
              { 时间: "19:00", 访问次数: 2436 },
              { 时间: "20:00", 访问次数: 4125 },
              { 时间: "21:00", 访问次数: 3201 },
              { 时间: "22:00", 访问次数: 2514 },
              { 时间: "23:00", 访问次数: 1026 }
            ]
          },
          week: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "周一", 访问次数: 1234 },
              { 时间: "周二", 访问次数: 5851 },
              { 时间: "周三", 访问次数: 4567 },
              { 时间: "周四", 访问次数: 4521 },
              { 时间: "周五", 访问次数: 2014 },
              { 时间: "周六", 访问次数: 4975 },
              { 时间: "周日", 访问次数: 4568 }
            ]
          },
          month: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1号", 访问次数: 1234 },
              { 时间: "2号", 访问次数: 5851 },
              { 时间: "3号", 访问次数: 4567 },
              { 时间: "4号", 访问次数: 4521 },
              { 时间: "5号", 访问次数: 2014 },
              { 时间: "6号", 访问次数: 4975 },
              { 时间: "7号", 访问次数: 4568 },
              { 时间: "8号", 访问次数: 3065 },
              { 时间: "9号", 访问次数: 2589 },
              { 时间: "10号", 访问次数: 4593 },
              { 时间: "11号", 访问次数: 5547 },
              { 时间: "12号", 访问次数: 714 },
              { 时间: "13号", 访问次数: 6520 },
              { 时间: "14号", 访问次数: 987 },
              { 时间: "15号", 访问次数: 1982 },
              { 时间: "16号", 访问次数: 2923 },
              { 时间: "17号", 访问次数: 2456 },
              { 时间: "18号", 访问次数: 3792 },
              { 时间: "19号", 访问次数: 1514 },
              { 时间: "20号", 访问次数: 2436 },
              { 时间: "21号", 访问次数: 4125 },
              { 时间: "22号", 访问次数: 3201 },
              { 时间: "23号", 访问次数: 2514 },
              { 时间: "24号", 访问次数: 1026 },
              { 时间: "25号", 访问次数: 1234 },
              { 时间: "26号", 访问次数: 5851 },
              { 时间: "27号", 访问次数: 4567 },
              { 时间: "28号", 访问次数: 4521 },
              { 时间: "29号", 访问次数: 2014 },
              { 时间: "30号", 访问次数: 4975 }
            ]
          },
          year: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1月", 访问次数: 1234 },
              { 时间: "2月", 访问次数: 5851 },
              { 时间: "3月", 访问次数: 4567 },
              { 时间: "4月", 访问次数: 4521 },
              { 时间: "5月", 访问次数: 2014 },
              { 时间: "6月", 访问次数: 4975 },
              { 时间: "7月", 访问次数: 4568 },
              { 时间: "8月", 访问次数: 3065 },
              { 时间: "9月", 访问次数: 2589 },
              { 时间: "10月", 访问次数: 4593 },
              { 时间: "11月", 访问次数: 5547 },
              { 时间: "12月", 访问次数: 714 }
            ]
          }
        }
      },
      // page3_mock_data
      databox3list1: {
        item01: "Mysql",
        item02: "√",
        item03: "×",
        item04: "√",
        item05: "√",
        item06: "√",
        item07: "×",
        item08: "√",
        item09: "√"
      },
      databox3list2: {
        item01: "MongoDB",
        item02: "√",
        item03: "×",
        item04: "√",
        item05: "√",
        item06: "√",
        item07: "×",
        item08: "√",
        item09: "√"
      }
    };
  },
  methods: {
    getChartData(e) {
      let self = this;
      let datas = {
        columns: ["时间", "处理总时长", "总处理记录数"],
        rows: [{ 时间: "1点", 处理总时长: 22, 总处理记录数: 12 }]
      };
      let PieData = {
        columns: ["任务", "执行时间"],
        rows: [{ 任务: "任务1", 执行时间: 393 }]
      };
      if (e === "day") {
        let rowData = [];
        let xTitle = [];

        for (let i = 1; i <= 24; i++) {
          // this.DateDatum.day.moreColg[i]['时间'] = moment().subtract(24 - i,'hours').format('HH')
          xTitle.push(
            moment()
              .subtract(24 - i, "hours")
              .format("HH") + "点"
          );
          // this.chartData.rows[i-1] = {}
          // this.chartData.rows[i-1].a = 1
        }

        xTitle.map(item => {
          let rowItem = {};
          rowItem["时间"] = item;
          rowItem["处理总时长"] = Math.random() * 100000;
          rowItem["总处理记录数"] = Math.random() * 100000;
          rowData.push(rowItem);
        });
        self.chartDatas.rows = rowData;
      } else if (e === "week") {
        let rowData = [];
        let rowItem = {
          时间: "1点",
          处理总时长: 22,
          总处理记录数: 12
        };
        let xTitle = [];
        for (let i = 1; i <= 24; i++) {
          // this.DateDatum.day.moreColg[i]['时间'] = moment().subtract(24 - i,'hours').format('HH')
          xTitle.push(
            moment()
              .subtract(24 - i, "hours")
              .format("HH") + "点"
          );
          // this.chartData.rows[i-1] = {}
          // this.chartData.rows[i-1].a = 1
        }
        xTitle.forEach((item, index) => {
          rowItem["时间"] = item;
          rowItem["处理总时长"] = Math.random() * 100000;
          rowItem["总处理记录数"] = Math.random() * 100000;
          rowData.push(rowItem);
        });
        this.chartDatas.rows = rowData;
      }
    }

    // toManangerment() {
    //   let str = window.location.href;
    //   let num = str.indexOf("?");
    //   str = str.substr(num + 1);

    //   window.location.href = "../../main/index.html?" + str;
    // },
    // toLogin() {
    //   sessionStorage.clear();
    //   // window.location.reload()
    //   this.$router.push({
    //     name: "login",
    //     query: {
    //       from: "onecard"
    //     }
    //   });
    // },
    // getData() {
    //   let params = {
    //     serviceName: "srvetl_job_history_select",
    //     colNames: ["*"],
    //     condition: [
    //       {
    //         colName: "start_time",
    //         ruleType: "between",
    //         value: "2018-02-26 00:00:00, 2019-03-25 00:00:00"
    //       }
    //     ],
    //     page: {
    //       pageNo: 1,
    //       rownumber: 2
    //     }
    //   };
    //   axios
    //     .post(
    //       "http://192.168.0.192:8101/datacenter/select/srvetl_job_history_select",
    //       params,
    //       {
    //         headers: {
    //           bx_auth_ticket: sessionStorage.getItem("bx_auth_ticket")
    //         }
    //       }
    //     )
    //     .then(res => {

    //     })
    //     .catch(err => {

    //     });
    // }

    // getAliNumMax(rightData){

    // }
  },

  // props: [
  //   "swiperOptionTop",
  //   "chartSetting1",
  //   "chartData01",
  //   "hospital",
  //   "card",
  //   "checkDataType"
  // ],
  mounted() {
    let arr = this.data01;
    let rightData = this.rightData;


  }
};
</script>

<style lang="scss">
.big-title {
  padding: 0 20px;
  text-align: center;
  line-height: 50px;
  font-size: 1.2rem;
}
</style>