<template>
  <div class="content etl-task">
    <dv-border-box-10 class="content_left col-65">
      <div class="content_left_left">
        <div class="big-title">ETL任务执行情况</div>
        <ve-line
          :data="chartDatas"
          :extend="chartExtendLine"
          height="calc(100% - 50px)"
          :textStyle="legend.textStyle"
          :settings="lineSetting"
          :legend="legend"
        ></ve-line>
      </div>
      <div class="content_left_right">
        <div class="content_left_right_item">
          <div class="item_title">
            <dv-border-box-8 :reverse="true">任务执行时间分布</dv-border-box-8>
          </div>
          <ve-pie
            height="28vh"
            :data="chartPieData1"
            :extend="chartExtendPie"
            :legend-visible="false"
            :settings="pieSetting"
          ></ve-pie>
        </div>
        <div class="content_left_right_item">
          <div class="item_title">
            <dv-border-box-8 :reverse="true">任务处理记录数分布</dv-border-box-8>
          </div>
          <ve-pie
            height="28vh"
            :data="chartPieData2"
            :extend="chartExtendPie"
            :legend-visible="false"
            :settings="pieSetting"
          ></ve-pie>
        </div>
      </div>
    </dv-border-box-10>
    <dv-border-box-10 class="content_right col-35 etl-task-right" ref="hospital_swiper">
      <div class="content_right_content">
        <div class="tab_content">
          <!-- <div style="text-align:center;" class="item_title">
            数据资源
          </div>-->
          <!-- <div class="content_item">
            <ve-histogram
              :data="chartData01"
              :textStyle="legend.textStyle"
              :legend="legend"
              height="73vh"
              :settings="chartSetting1"
            ></ve-histogram>
          </div>-->
          <!-- <div class="last">
              <span>上一次</span>
              <span>下一次</span>
              <span>选择记录</span>
            </div>
            <div class="gantt_task">
              <span>任务1</span>
              <span>任务2</span>
              <span>任务3</span>
          </div>-->
          <!-- <th>任务开始时间</th>
                <th>分阶段开始时间</th>
                <th>分阶段结束时间</th>
                <th>处理记录数</th>
                <th>加载记录数</th>
          <th>结束时间</th>-->
          <!-- <td>{{item.start}}</td>
                <td>{{item.fareStart}}</td>
                <td>{{item.fareEnd}}</td>
                <td>{{item.processing}}</td>
                <td>{{item.endTime}}</td>
          <td>{{item.loader}}</td>-->
          <div class="databox_three">
            <!-- <div class="databox_three_top">数据库监控</div> -->
            <div class="last">
              <span @click="GoLast">上一次</span>
              <span @click="GoNext">下一次</span>
              <span>选择记录</span>
            </div>
            <div class="gantt_task">
              <span
                @click="checkTask(item)"
                v-for="(item,index) in taskName"
                :key="index"
              >{{item.job_name}}</span>
            </div>
            <div class="databox_three_content">
              <div class="databox_three_contentheader">
                <div class="databox-col">开始时间</div>
                <div class="databox-col">任务名称</div>
                <div class="databox-col">失败记录数</div>
                <div class="databox-col">成功记录数</div>
                <div class="databox-col">输入记录数</div>
                <div class="databox-col">输出记录数</div>
                <div class="databox-col">结束时间</div>
              </div>
              <div
                v-show="index < 6"
                class="databox-three-contentdata-view"
                v-for="(item,index) in GanttData"
                :key="index"
              >
                <div class="databox-col">{{item.start_time}}</div>
                <div class="databox-col">{{item.processor_name}}</div>
                <div class="databox-col">{{item.failed_records_count}}</div>
                <div class="databox-col">{{item.ok_records_count}}</div>
                <div class="databox-col">{{item.input_record_count}}</div>
                <div class="databox-col">{{item.output_record_count}}</div>
                <div class="databox-col">{{item.end_time}}</div>
                <!-- <div class="databox-col">{{item.item08}}</div> -->
              </div>
              <div style="text-align:center;padding:5rem 0;" v-if="!this.GanttData.length">~ 暂无数据 ~</div>
              <!-- <ul class="databox_three_contentdata2" v-if="databox3list2">
          <div>{{databox3list2.item01}}</div>
          <div>{{databox3list2.item02}}</div>
          <div>{{databox3list2.item03}}</li>
          <li>{{databox3list2.item04}}</li>
          <li>{{databox3list2.item05}}</li>
          <li>{{databox3list2.item06}}</li>
          <li>{{databox3list2.item07}}</li>
          <li>{{databox3list2.item08}}</li>
              </ul>-->
            </div>
          </div>
        </div>
      </div>
    </dv-border-box-10>
  </div>
</template>

<script>
import { setTimeout } from "timers";
let moment = require("moment");

export default {
  data() {
    this.chartExtendLine = {
      grid: {
        top: "10%",
        bottom: "10",
        height: "auto",
      },
      series: {
        center: ["50%", "55%"],
      },
    };
    this.chartExtendPie = {
      grid: {
        top: "10",
        bottom: "0",
        height: "auto",
      },
      series: {
        center: ["50%", "50%"],
        radius: [0, "30%"],
      },
    };
    this.pieSetting = {
      radius: 80,
      offsetY: 160,
    };
    this.pieSetting3 = {
      radius: 50,
      offsetY: 120,
    };
    this.lineSetting = {};
    return {
      chooseNum: 0,
      step: [],
      taskName: [],
      taskNo: "",
      chartDatas: {
        columns: ["时间", "处理总时长", "总处理记录数"],
        rows: [
          { 时间: "1点", 处理总时长: 22, 总处理记录数: 12 },
          { 时间: "2点", 处理总时长: 22, 总处理记录数: 12 },
        ],
      },
      GanttData: [],
      chartPieData1: {
        columns: ["任务", "执行时间"],
        rows: [
          { 任务: "任务1", 执行时间: 393 },
          { 任务: "任务2", 执行时间: 530 },
          { 任务: "任务3", 执行时间: 923 },
          { 任务: "任务4", 执行时间: 723 },
          { 任务: "任务5", 执行时间: 792 },
          { 任务: "任务6", 执行时间: 593 },
        ],
      },
      chartPieData2: {
        columns: ["任务", "处理记录数"],
        rows: [
          { 任务: "任务1", 处理记录数: 1393 },
          { 任务: "任务2", 处理记录数: 2530 },
          { 任务: "任务3", 处理记录数: 3923 },
          { 任务: "任务4", 处理记录数: 1723 },
          { 任务: "任务5", 处理记录数: 1792 },
          { 任务: "任务6", 处理记录数: 1593 },
        ],
      },

      date: null,
      legend: {
        textStyle: {
          color: "#fff",
          fontSize: 10,
        },
      },
      chartSetting1: {
        stack: {
          用户: [
            "延大附院",
            "市中医医院",
            "市人民医院",
            "市妇幼医院",
            "宝塔区医院",
          ],
        },
      },
      swiperOptionTop: {
        watchSlidesProgress: true,
        watchSlidesVisibility: true,
        loopedSlides: 5,
        autoplay: {
          delay: 3000,
          disableOnInteraction: false,
        },
        //轮播豆豆
        // pagination: {
        //   el: '.swiper-pagination',
        //   clickable: true,
        //   renderBullet(index, className) {
        //     let hospital_name = ['延大附院', '市中医医院', '市人民医院', '市妇幼医院', '宝塔区医院'];
        //     return `<span class="${className} swiper-pagination-bullet-custom">${hospital_name[index]}</span>`;
        //   }
        // }
      },
      chartData01: {},
      pieData1: {
        hospital: {},
        card: {},
      },
      chartData02: {
        hos1: {},
        hos2: {},
        hos3: {},
        hos4: {},
        hos5: {},
      },
      data01: {
        day: {
          columns: [
            "时间",
            "延大附院",
            "市中医医院",
            "市人民医院",
            "市妇幼医院",
            "宝塔区医院",
          ],
          rows: [
            {
              时间: "00:00",
              延大附院: 5,
              市中医医院: 2,
              市人民医院: 1,
              市妇幼医院: 0,
              宝塔区医院: 0,
            },
            {
              时间: "01:00",
              延大附院: 3,
              市中医医院: 5,
              市人民医院: 2,
              市妇幼医院: 2,
              宝塔区医院: 0,
            },
            {
              时间: "02:00",
              延大附院: 1,
              市中医医院: 0,
              市人民医院: 0,
              市妇幼医院: 1,
              宝塔区医院: 0,
            },
            {
              时间: "03:00",
              延大附院: 2,
              市中医医院: 0,
              市人民医院: 1,
              市妇幼医院: 0,
              宝塔区医院: 1,
            },
            {
              时间: "04:00",
              延大附院: 2014,
              市中医医院: 1423,
              市人民医院: 1423,
              市妇幼医院: 1423,
              宝塔区医院: 0.49,
            },
            {
              时间: "05:00",
              延大附院: 4975,
              市中医医院: 3492,
              市人民医院: 3492,
              市妇幼医院: 3492,
              宝塔区医院: 0.323,
            },
            {
              时间: "06:00",
              延大附院: 4568,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "07:00",
              延大附院: 3065,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "08:00",
              延大附院: 2589,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "09:00",
              延大附院: 4593,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "10:00",
              延大附院: 5547,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "11:00",
              延大附院: 714,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "12:00",
              延大附院: 6520,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "13:00",
              延大附院: 987,
              市中医医院: 1093,
              市人民医院: 1093,
              市妇幼医院: 1093,
              宝塔区医院: 0.32,
            },
            {
              时间: "14:00",
              延大附院: 1982,
              市中医医院: 3230,
              市人民医院: 3230,
              市妇幼医院: 3230,
              宝塔区医院: 0.26,
            },
            {
              时间: "15:00",
              延大附院: 2923,
              市中医医院: 2623,
              市人民医院: 2623,
              市妇幼医院: 2623,
              宝塔区医院: 0.76,
            },
            {
              时间: "16:00",
              延大附院: 2456,
              市中医医院: 1423,
              市人民医院: 1423,
              市妇幼医院: 1423,
              宝塔区医院: 0.49,
            },
            {
              时间: "17:00",
              延大附院: 3792,
              市中医医院: 3492,
              市人民医院: 3492,
              市妇幼医院: 3492,
              宝塔区医院: 0.323,
            },
            {
              时间: "18:00",
              延大附院: 1514,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "19:00",
              延大附院: 2436,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "20:00",
              延大附院: 4125,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "21:00",
              延大附院: 3201,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "22:00",
              延大附院: 2514,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "23:00",
              延大附院: 1026,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
          ],
        },
        week: {
          columns: [
            "时间",
            "延大附院",
            "市中医医院",
            "市人民医院",
            "市妇幼医院",
            "宝塔区医院",
          ],
          rows: [
            {
              时间: "周一",
              延大附院: 1234,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "周二",
              延大附院: 5851,
              市中医医院: 1093,
              市人民医院: 1093,
              市妇幼医院: 1093,
              宝塔区医院: 0.32,
            },
            {
              时间: "周三",
              延大附院: 4567,
              市中医医院: 3230,
              市人民医院: 3230,
              市妇幼医院: 3230,
              宝塔区医院: 0.26,
            },
            {
              时间: "周四",
              延大附院: 4521,
              市中医医院: 2623,
              市人民医院: 2623,
              市妇幼医院: 2623,
              宝塔区医院: 0.76,
            },
            {
              时间: "周五",
              延大附院: 2014,
              市中医医院: 1423,
              市人民医院: 1423,
              市妇幼医院: 1423,
              宝塔区医院: 0.49,
            },
            {
              时间: "周六",
              延大附院: 4975,
              市中医医院: 3492,
              市人民医院: 3492,
              市妇幼医院: 3492,
              宝塔区医院: 0.323,
            },
            {
              时间: "周日",
              延大附院: 4568,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
          ],
        },
        month: {
          columns: [
            "时间",
            "延大附院",
            "市中医医院",
            "市人民医院",
            "市妇幼医院",
            "宝塔区医院",
          ],
          rows: [
            {
              时间: "1号",
              延大附院: 1234,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "2号",
              延大附院: 5851,
              市中医医院: 1093,
              市人民医院: 1093,
              市妇幼医院: 1093,
              宝塔区医院: 0.32,
            },
            {
              时间: "3号",
              延大附院: 4567,
              市中医医院: 3230,
              市人民医院: 3230,
              市妇幼医院: 3230,
              宝塔区医院: 0.26,
            },
            {
              时间: "4号",
              延大附院: 4521,
              市中医医院: 2623,
              市人民医院: 2623,
              市妇幼医院: 2623,
              宝塔区医院: 0.76,
            },
            {
              时间: "5号",
              延大附院: 2014,
              市中医医院: 1423,
              市人民医院: 1423,
              市妇幼医院: 1423,
              宝塔区医院: 0.49,
            },
            {
              时间: "6号",
              延大附院: 4975,
              市中医医院: 3492,
              市人民医院: 3492,
              市妇幼医院: 3492,
              宝塔区医院: 0.323,
            },
            {
              时间: "7号",
              延大附院: 4568,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "8号",
              延大附院: 3065,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "9号",
              延大附院: 2589,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "10号",
              延大附院: 4593,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "11号",
              延大附院: 5547,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "12号",
              延大附院: 714,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "13号",
              延大附院: 6520,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "14号",
              延大附院: 987,
              市中医医院: 1093,
              市人民医院: 1093,
              市妇幼医院: 1093,
              宝塔区医院: 0.32,
            },
            {
              时间: "15号",
              延大附院: 1982,
              市中医医院: 3230,
              市人民医院: 3230,
              市妇幼医院: 3230,
              宝塔区医院: 0.26,
            },
            {
              时间: "16号",
              延大附院: 2923,
              市中医医院: 2623,
              市人民医院: 2623,
              市妇幼医院: 2623,
              宝塔区医院: 0.76,
            },
            {
              时间: "17号",
              延大附院: 2456,
              市中医医院: 1423,
              市人民医院: 1423,
              市妇幼医院: 1423,
              宝塔区医院: 0.49,
            },
            {
              时间: "18号",
              延大附院: 3792,
              市中医医院: 3492,
              市人民医院: 3492,
              市妇幼医院: 3492,
              宝塔区医院: 0.323,
            },
            {
              时间: "19号",
              延大附院: 1514,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "20号",
              延大附院: 2436,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "21号",
              延大附院: 4125,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "22号",
              延大附院: 3201,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "23号",
              延大附院: 2514,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "24号",
              延大附院: 1026,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "25号",
              延大附院: 1234,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "26号",
              延大附院: 5851,
              市中医医院: 1093,
              市人民医院: 1093,
              市妇幼医院: 1093,
              宝塔区医院: 0.32,
            },
            {
              时间: "27号",
              延大附院: 4567,
              市中医医院: 3230,
              市人民医院: 3230,
              市妇幼医院: 3230,
              宝塔区医院: 0.26,
            },
            {
              时间: "28号",
              延大附院: 4521,
              市中医医院: 2623,
              市人民医院: 2623,
              市妇幼医院: 2623,
              宝塔区医院: 0.76,
            },
            {
              时间: "29号",
              延大附院: 2014,
              市中医医院: 1423,
              市人民医院: 1423,
              市妇幼医院: 1423,
              宝塔区医院: 0.49,
            },
            {
              时间: "30号",
              延大附院: 4975,
              市中医医院: 3492,
              市人民医院: 3492,
              市妇幼医院: 3492,
              宝塔区医院: 0.323,
            },
          ],
        },
        year: {
          columns: [
            "时间",
            "延大附院",
            "市中医医院",
            "市人民医院",
            "市妇幼医院",
            "宝塔区医院",
          ],
          rows: [
            {
              时间: "1月",
              延大附院: 1234,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "2月",
              延大附院: 5851,
              市中医医院: 1093,
              市人民医院: 1093,
              市妇幼医院: 1093,
              宝塔区医院: 0.32,
            },
            {
              时间: "3月",
              延大附院: 4567,
              市中医医院: 3230,
              市人民医院: 3230,
              市妇幼医院: 3230,
              宝塔区医院: 0.26,
            },
            {
              时间: "4月",
              延大附院: 4521,
              市中医医院: 2623,
              市人民医院: 2623,
              市妇幼医院: 2623,
              宝塔区医院: 0.76,
            },
            {
              时间: "5月",
              延大附院: 2014,
              市中医医院: 1423,
              市人民医院: 1423,
              市妇幼医院: 1423,
              宝塔区医院: 0.49,
            },
            {
              时间: "6月",
              延大附院: 4975,
              市中医医院: 3492,
              市人民医院: 3492,
              市妇幼医院: 3492,
              宝塔区医院: 0.323,
            },
            {
              时间: "7月",
              延大附院: 4568,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "8月",
              延大附院: 3065,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "9月",
              延大附院: 2589,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "10月",
              延大附院: 4593,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "11月",
              延大附院: 5547,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
            {
              时间: "12月",
              延大附院: 714,
              市中医医院: 4293,
              市人民医院: 4293,
              市妇幼医院: 4293,
              宝塔区医院: 0.78,
            },
          ],
        },
      },
      data02: {
        hos_num_pie: {
          day: {
            columns: ["医院", "访问用户"],
            rows: [
              { 医院: "延大附院", 访问用户: 154 },
              { 医院: "市中医医院", 访问用户: 33 },
              { 医院: "市人民医院", 访问用户: 75 },
              { 医院: "市妇幼医院", 访问用户: 27 },
              { 医院: "宝塔区医院", 访问用户: 19 },
            ],
          },
          week: {
            columns: ["医院", "访问用户"],
            rows: [
              { 医院: "延大附院", 访问用户: 515 },
              { 医院: "市中医医院", 访问用户: 365 },
              { 医院: "市人民医院", 访问用户: 245 },
              { 医院: "市妇幼医院", 访问用户: 147 },
              { 医院: "宝塔区医院", 访问用户: 251 },
            ],
          },
          month: {
            columns: ["医院", "访问用户"],
            rows: [
              { 医院: "延大附院", 访问用户: 2564 },
              { 医院: "市中医医院", 访问用户: 1859 },
              { 医院: "市人民医院", 访问用户: 1574 },
              { 医院: "市妇幼医院", 访问用户: 982 },
              { 医院: "宝塔区医院", 访问用户: 1664 },
            ],
          },
          year: {
            columns: ["医院", "访问用户"],
            rows: [
              { 医院: "延大附院", 访问用户: 15789 },
              { 医院: "市中医医院", 访问用户: 12658 },
              { 医院: "市人民医院", 访问用户: 6598 },
              { 医院: "市妇幼医院", 访问用户: 9852 },
              { 医院: "宝塔区医院", 访问用户: 5698 },
            ],
          },
        },
        card_num_pie: {
          day: {
            columns: ["卡类型", "访问用户"],
            rows: [
              { 卡类型: "身份证", 访问用户: 235 },
              { 卡类型: "社保卡", 访问用户: 123 },
              { 卡类型: "就诊卡", 访问用户: 75 },
            ],
          },
          week: {
            columns: ["卡类型", "访问用户"],
            rows: [
              { 卡类型: "身份证", 访问用户: 1235 },
              { 卡类型: "社保卡", 访问用户: 1123 },
              { 卡类型: "就诊卡", 访问用户: 175 },
            ],
          },
          month: {
            columns: ["卡类型", "访问用户"],
            rows: [
              { 卡类型: "身份证", 访问用户: 7235 },
              { 卡类型: "社保卡", 访问用户: 7123 },
              { 卡类型: "就诊卡", 访问用户: 775 },
            ],
          },
          year: {
            columns: ["卡类型", "访问用户"],
            rows: [
              { 卡类型: "身份证", 访问用户: 11235 },
              { 卡类型: "社保卡", 访问用户: 11123 },
              { 卡类型: "就诊卡", 访问用户: 1175 },
            ],
          },
        },
      },
      hos_bar_data: {
        hos2Data: {
          day: {
            columns: ["时间", "处理总时长", "总处理记录数"],
            rows: [
              { 时间: "1点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "2点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "3点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "4点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "5点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "6点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "7点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "8点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "9点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "10点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "11点", 处理总时长: 22, 总处理记录数: 12 },
              { 时间: "12点", 处理总时长: 22, 总处理记录数: 12 },
            ],
          },
          week: {
            columns: ["任务", "处理总时长", "总处理记录数"],
            rows: [
              { 任务: "任务1", 处理总时长: 24, 总处理记录数: 32 },
              { 任务: "任务2", 处理总时长: 51, 总处理记录数: 49 },
              { 任务: "任务3", 处理总时长: 67, 总处理记录数: 55 },
              { 任务: "任务4", 处理总时长: 21, 总处理记录数: 61 },
              { 任务: "任务5", 处理总时长: 14, 总处理记录数: 20 },
              { 任务: "任务6", 处理总时长: 75, 总处理记录数: 112 },
              { 任务: "任务7", 处理总时长: 68, 总处理记录数: 95 },
            ],
          },
          month: {
            columns: ["任务", "处理总时长", "总处理记录数"],
            rows: [
              { 任务: "任务1", 处理总时长: 234, 总处理记录数: 54 },
              { 任务: "任务2", 处理总时长: 851, 总处理记录数: 52 },
              { 任务: "任务3", 处理总时长: 567, 总处理记录数: 61 },
              { 任务: "任务4", 处理总时长: 521, 总处理记录数: 81 },
              { 任务: "任务5", 处理总时长: 114, 总处理记录数: 56 },
              { 任务: "任务6", 处理总时长: 975, 总处理记录数: 62 },
              { 任务: "任务7", 处理总时长: 468, 总处理记录数: 58 },
            ],
          },
          year: {
            columns: ["任务", "处理总时长", "总处理记录数"],
            rows: [
              { 任务: "任务1", 处理总时长: 234, 总处理记录数: 118 },
              { 任务: "任务2", 处理总时长: 851, 总处理记录数: 128 },
              { 任务: "任务3", 处理总时长: 567, 总处理记录数: 98 },
              { 任务: "任务4", 处理总时长: 521, 总处理记录数: 68 },
              { 任务: "任务5", 处理总时长: 14, 总处理记录数: 59 },
              { 任务: "任务6", 处理总时长: 975, 总处理记录数: 26 },
              { 任务: "任务7", 处理总时长: 568, 总处理记录数: 63 },
            ],
          },
        },
        hos3Data: {
          day: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "00:00", 访问次数: 1 },
              { 时间: "01:00", 访问次数: 5 },
              { 时间: "02:00", 访问次数: 4 },
              { 时间: "03:00", 访问次数: 4 },
              { 时间: "04:00", 访问次数: 2 },
              { 时间: "05:00", 访问次数: 4 },
              { 时间: "06:00", 访问次数: 4 },
              { 时间: "07:00", 访问次数: 3 },
              { 时间: "08:00", 访问次数: 2 },
              { 时间: "09:00", 访问次数: 4 },
              { 时间: "10:00", 访问次数: 5 },
              { 时间: "11:00", 访问次数: 7 },
              { 时间: "12:00", 访问次数: 6 },
              { 时间: "13:00", 访问次数: 9 },
              { 时间: "14:00", 访问次数: 1 },
              { 时间: "15:00", 访问次数: 2 },
              { 时间: "16:00", 访问次数: 2 },
              { 时间: "17:00", 访问次数: 3 },
              { 时间: "18:00", 访问次数: 1 },
              { 时间: "19:00", 访问次数: 2 },
              { 时间: "20:00", 访问次数: 4 },
              { 时间: "21:00", 访问次数: 3 },
              { 时间: "22:00", 访问次数: 2 },
              { 时间: "23:00", 访问次数: 1 },
            ],
          },
          week: {
            columns: ["时间", " 访问次数"],
            rows: [
              { 时间: "周一", 访问次数: 154 },
              { 时间: "周二", 访问次数: 551 },
              { 时间: "周三", 访问次数: 457 },
              { 时间: "周四", 访问次数: 451 },
              { 时间: "周五", 访问次数: 254 },
              { 时间: "周六", 访问次数: 455 },
              { 时间: "周日", 访问次数: 458 },
            ],
          },
          month: {
            columns: ["时间", " 访问次数"],
            rows: [
              { 时间: "1号", 访问次数: 234 },
              { 时间: "2号", 访问次数: 851 },
              { 时间: "3号", 访问次数: 567 },
              { 时间: "4号", 访问次数: 521 },
              { 时间: "5号", 访问次数: 14 },
              { 时间: "6号", 访问次数: 975 },
              { 时间: "7号", 访问次数: 568 },
              { 时间: "8号", 访问次数: 65 },
              { 时间: "9号", 访问次数: 589 },
              { 时间: "10号", 访问次数: 593 },
              { 时间: "11号", 访问次数: 547 },
              { 时间: "12号", 访问次数: 14 },
              { 时间: "13号", 访问次数: 520 },
              { 时间: "14号", 访问次数: 87 },
              { 时间: "15号", 访问次数: 982 },
              { 时间: "16号", 访问次数: 923 },
              { 时间: "17号", 访问次数: 456 },
              { 时间: "18号", 访问次数: 792 },
              { 时间: "19号", 访问次数: 514 },
              { 时间: "20号", 访问次数: 436 },
              { 时间: "21号", 访问次数: 125 },
              { 时间: "22号", 访问次数: 201 },
              { 时间: "23号", 访问次数: 514 },
              { 时间: "24号", 访问次数: 26 },
              { 时间: "25号", 访问次数: 234 },
              { 时间: "26号", 访问次数: 851 },
              { 时间: "27号", 访问次数: 567 },
              { 时间: "28号", 访问次数: 521 },
              { 时间: "29号", 访问次数: 14 },
              { 时间: "30号", 访问次数: 975 },
            ],
          },
          year: {
            columns: ["时间", " 访问次数"],
            rows: [
              { 时间: "1月", 访问次数: 1234 },
              { 时间: "2月", 访问次数: 5251 },
              { 时间: "3月", 访问次数: 4267 },
              { 时间: "4月", 访问次数: 4221 },
              { 时间: "5月", 访问次数: 2214 },
              { 时间: "6月", 访问次数: 4275 },
              { 时间: "7月", 访问次数: 4268 },
              { 时间: "8月", 访问次数: 3265 },
              { 时间: "9月", 访问次数: 2289 },
              { 时间: "10月", 访问次数: 4293 },
              { 时间: "11月", 访问次数: 5247 },
              { 时间: "12月", 访问次数: 724 },
            ],
          },
        },
        hos4Data: {
          day: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "00:00", 访问次数: 1234 },
              { 时间: "01:00", 访问次数: 5851 },
              { 时间: "02:00", 访问次数: 4567 },
              { 时间: "03:00", 访问次数: 4521 },
              { 时间: "04:00", 访问次数: 2014 },
              { 时间: "05:00", 访问次数: 4975 },
              { 时间: "06:00", 访问次数: 4568 },
              { 时间: "07:00", 访问次数: 3065 },
              { 时间: "08:00", 访问次数: 2589 },
              { 时间: "09:00", 访问次数: 4593 },
              { 时间: "10:00", 访问次数: 5547 },
              { 时间: "11:00", 访问次数: 714 },
              { 时间: "12:00", 访问次数: 6520 },
              { 时间: "13:00", 访问次数: 987 },
              { 时间: "14:00", 访问次数: 1982 },
              { 时间: "15:00", 访问次数: 2923 },
              { 时间: "16:00", 访问次数: 2456 },
              { 时间: "17:00", 访问次数: 3792 },
              { 时间: "18:00", 访问次数: 1514 },
              { 时间: "19:00", 访问次数: 2436 },
              { 时间: "20:00", 访问次数: 4125 },
              { 时间: "21:00", 访问次数: 3201 },
              { 时间: "22:00", 访问次数: 2514 },
              { 时间: "23:00", 访问次数: 1026 },
            ],
          },
          week: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "周一", 访问次数: 1234 },
              { 时间: "周二", 访问次数: 5851 },
              { 时间: "周三", 访问次数: 4567 },
              { 时间: "周四", 访问次数: 4521 },
              { 时间: "周五", 访问次数: 2014 },
              { 时间: "周六", 访问次数: 4975 },
              { 时间: "周日", 访问次数: 4568 },
            ],
          },
          month: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1号", 访问次数: 1234 },
              { 时间: "2号", 访问次数: 5851 },
              { 时间: "3号", 访问次数: 4567 },
              { 时间: "4号", 访问次数: 4521 },
              { 时间: "5号", 访问次数: 2014 },
              { 时间: "6号", 访问次数: 4975 },
              { 时间: "7号", 访问次数: 4568 },
              { 时间: "8号", 访问次数: 3065 },
              { 时间: "9号", 访问次数: 2589 },
              { 时间: "10号", 访问次数: 4593 },
              { 时间: "11号", 访问次数: 5547 },
              { 时间: "12号", 访问次数: 714 },
              { 时间: "13号", 访问次数: 6520 },
              { 时间: "14号", 访问次数: 987 },
              { 时间: "15号", 访问次数: 1982 },
              { 时间: "16号", 访问次数: 2923 },
              { 时间: "17号", 访问次数: 2456 },
              { 时间: "18号", 访问次数: 3792 },
              { 时间: "19号", 访问次数: 1514 },
              { 时间: "20号", 访问次数: 2436 },
              { 时间: "21号", 访问次数: 4125 },
              { 时间: "22号", 访问次数: 3201 },
              { 时间: "23号", 访问次数: 2514 },
              { 时间: "24号", 访问次数: 1026 },
              { 时间: "25号", 访问次数: 1234 },
              { 时间: "26号", 访问次数: 5851 },
              { 时间: "27号", 访问次数: 4567 },
              { 时间: "28号", 访问次数: 4521 },
              { 时间: "29号", 访问次数: 2014 },
              { 时间: "30号", 访问次数: 4975 },
            ],
          },
          year: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1月", 访问次数: 1234 },
              { 时间: "2月", 访问次数: 5851 },
              { 时间: "3月", 访问次数: 4567 },
              { 时间: "4月", 访问次数: 4521 },
              { 时间: "5月", 访问次数: 2014 },
              { 时间: "6月", 访问次数: 4975 },
              { 时间: "7月", 访问次数: 4568 },
              { 时间: "8月", 访问次数: 3065 },
              { 时间: "9月", 访问次数: 2589 },
              { 时间: "10月", 访问次数: 4593 },
              { 时间: "11月", 访问次数: 5547 },
              { 时间: "12月", 访问次数: 714 },
            ],
          },
        },
        hos5Data: {
          day: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "00:00", 访问次数: 1234 },
              { 时间: "01:00", 访问次数: 5851 },
              { 时间: "02:00", 访问次数: 4567 },
              { 时间: "03:00", 访问次数: 4521 },
              { 时间: "04:00", 访问次数: 2014 },
              { 时间: "05:00", 访问次数: 4975 },
              { 时间: "06:00", 访问次数: 4568 },
              { 时间: "07:00", 访问次数: 3065 },
              { 时间: "08:00", 访问次数: 2589 },
              { 时间: "09:00", 访问次数: 4593 },
              { 时间: "10:00", 访问次数: 5547 },
              { 时间: "11:00", 访问次数: 714 },
              { 时间: "12:00", 访问次数: 6520 },
              { 时间: "13:00", 访问次数: 987 },
              { 时间: "14:00", 访问次数: 1982 },
              { 时间: "15:00", 访问次数: 2923 },
              { 时间: "16:00", 访问次数: 2456 },
              { 时间: "17:00", 访问次数: 3792 },
              { 时间: "18:00", 访问次数: 1514 },
              { 时间: "19:00", 访问次数: 2436 },
              { 时间: "20:00", 访问次数: 4125 },
              { 时间: "21:00", 访问次数: 3201 },
              { 时间: "22:00", 访问次数: 2514 },
              { 时间: "23:00", 访问次数: 1026 },
            ],
          },
          week: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "周一", 访问次数: 1234 },
              { 时间: "周二", 访问次数: 5851 },
              { 时间: "周三", 访问次数: 4567 },
              { 时间: "周四", 访问次数: 4521 },
              { 时间: "周五", 访问次数: 2014 },
              { 时间: "周六", 访问次数: 4975 },
              { 时间: "周日", 访问次数: 4568 },
            ],
          },
          month: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1号", 访问次数: 1234 },
              { 时间: "2号", 访问次数: 5851 },
              { 时间: "3号", 访问次数: 4567 },
              { 时间: "4号", 访问次数: 4521 },
              { 时间: "5号", 访问次数: 2014 },
              { 时间: "6号", 访问次数: 4975 },
              { 时间: "7号", 访问次数: 4568 },
              { 时间: "8号", 访问次数: 3065 },
              { 时间: "9号", 访问次数: 2589 },
              { 时间: "10号", 访问次数: 4593 },
              { 时间: "11号", 访问次数: 5547 },
              { 时间: "12号", 访问次数: 714 },
              { 时间: "13号", 访问次数: 6520 },
              { 时间: "14号", 访问次数: 987 },
              { 时间: "15号", 访问次数: 1982 },
              { 时间: "16号", 访问次数: 2923 },
              { 时间: "17号", 访问次数: 2456 },
              { 时间: "18号", 访问次数: 3792 },
              { 时间: "19号", 访问次数: 1514 },
              { 时间: "20号", 访问次数: 2436 },
              { 时间: "21号", 访问次数: 4125 },
              { 时间: "22号", 访问次数: 3201 },
              { 时间: "23号", 访问次数: 2514 },
              { 时间: "24号", 访问次数: 1026 },
              { 时间: "25号", 访问次数: 1234 },
              { 时间: "26号", 访问次数: 5851 },
              { 时间: "27号", 访问次数: 4567 },
              { 时间: "28号", 访问次数: 4521 },
              { 时间: "29号", 访问次数: 2014 },
              { 时间: "30号", 访问次数: 4975 },
            ],
          },
          year: {
            columns: ["时间", "访问次数"],
            rows: [
              { 时间: "1月", 访问次数: 1234 },
              { 时间: "2月", 访问次数: 5851 },
              { 时间: "3月", 访问次数: 4567 },
              { 时间: "4月", 访问次数: 4521 },
              { 时间: "5月", 访问次数: 2014 },
              { 时间: "6月", 访问次数: 4975 },
              { 时间: "7月", 访问次数: 4568 },
              { 时间: "8月", 访问次数: 3065 },
              { 时间: "9月", 访问次数: 2589 },
              { 时间: "10月", 访问次数: 4593 },
              { 时间: "11月", 访问次数: 5547 },
              { 时间: "12月", 访问次数: 714 },
            ],
          },
        },
      },
      // page3_mock_data
      databox3list1: {
        item01: "Mysql",
        item02: "√",
        item03: "×",
        item04: "√",
        item05: "√",
        item06: "√",
        item07: "×",
        item08: "√",
        item09: "√",
      },
      databox3list2: {
        item01: "MongoDB",
        item02: "√",
        item03: "×",
        item04: "√",
        item05: "√",
        item06: "√",
        item07: "×",
        item08: "√",
        item09: "√",
      },
    };
  },
  methods: {
    GoLast() {
      this.chooseNum++;
      if (this.chooseNum <= this.step.length - 1)
        this.taskNo = this.step[this.chooseNum].job_no;
      this.getNewTask(this.taskNo);
    },
    GoNext() {
      this.chooseNum--;
      if (this.chooseNum >= 0) this.taskNo = this.step[this.chooseNum].job_no;
      this.getNewTask(this.taskNo);
    },
    getPieData(e) {
      let self = this;
      let datas = {
        columns: ["任务", "执行时间"],
        rows: [
          { 任务: "任务1", 执行时间: 393 },
          { 任务: "任务2", 执行时间: 530 },
          { 任务: "任务3", 执行时间: 923 },
          { 任务: "任务4", 执行时间: 723 },
          { 任务: "任务5", 执行时间: 792 },
          { 任务: "任务6", 执行时间: 593 },
        ],
      };

      datas.rows.map((item) => {
        item["执行时间"] = Math.random() * 100;
      });
      this.chartPieData1 = datas;
      this.chartPieData2 = datas;
    },
    getChartData(e) {
      let self = this;
      let datas = {
        columns: ["时间", "处理总时长", "总处理记录数"],
        rows: [{ 时间: "1点", 处理总时长: 22, 总处理记录数: 12 }],
      };
      let PieData = {
        columns: ["任务", "执行时间"],
        rows: [{ 任务: "任务1", 执行时间: 393 }],
      };

      this.step.forEach((item) => {});

      if (e === "day") {
        let rowData = [];
        let xTitle = [];

        for (let i = 1; i <= 24; i++) {
          // this.DateDatum.day.moreColg[i]['时间'] = moment().subtract(24 - i,'hours').format('HH')
          xTitle.push(
            moment()
              .subtract(24 - i, "hours")
              .format("HH") + "点"
          );
          // this.chartData.rows[i-1] = {}
          // this.chartData.rows[i-1].a = 1
        }

        xTitle.map((item) => {
          let rowItem = {};
          rowItem["时间"] = item;
          rowItem["处理总时长"] = Math.random() * 100000;
          rowItem["总处理记录数"] = Math.random() * 100000;
          rowData.push(rowItem);
        });
        self.chartDatas.rows = rowData;
      } else if (e === "week") {
        let rowData = [];
        let rowItem = {
          时间: "1点",
          处理总时长: 22,
          总处理记录数: 12,
        };
        let xTitle = [];
        for (let i = 1; i <= 7; i++) {
          xTitle.push(
            moment()
              .subtract(7 - i, "weeks")
              .format("YYYY-MM-DD")
          );
        }

        xTitle.map((item) => {
          let rowItem = {};
          rowItem["时间"] = item;
          rowItem["处理总时长"] = Math.random() * 100000;
          rowItem["总处理记录数"] = Math.random() * 100000;
          rowData.push(rowItem);
        });
        this.chartDatas.rows = rowData;
      } else if (e === "month") {
        let rowData = [];
        let rowItem = {
          时间: "1点",
          处理总时长: 22,
          总处理记录数: 12,
        };
        let xTitle = [];
        for (let i = 1; i <= 30; i++) {
          xTitle.push(
            moment()
              .subtract(30 - i, "days")
              .format("MM-DD")
          );
        }
        xTitle.map((item) => {
          let rowItem = {};
          rowItem["时间"] = item;
          rowItem["处理总时长"] = Math.random() * 100000;
          rowItem["总处理记录数"] = Math.random() * 100000;
          rowData.push(rowItem);
        });

        this.chartDatas.rows = rowData;
      } else if (e === "year") {
        let rowData = [];
        let rowItem = {
          时间: "1点",
          处理总时长: 22,
          总处理记录数: 12,
        };
        let xTitle = [];
        for (let i = 1; i <= 12; i++) {
          xTitle.push(
            moment()
              .subtract(12 - i, "month")
              .format("YYYY-MM")
          );
        }
        xTitle.map((item) => {
          let rowItem = {};
          rowItem["时间"] = item;
          rowItem["处理总时长"] = Math.random() * 100000;
          rowItem["总处理记录数"] = Math.random() * 100000;
          rowData.push(rowItem);
        });

        this.chartDatas.rows = rowData;
      }
    },
    checkTask(item) {
      let NewStep = [];
      let value = item.job_no;
      let name = item.job_name;
      let params = {
        serviceName: "srvetl_job_history_select",
        colNames: ["*"],
        condition: [],
        group: [
          {
            colName: "job_no",
            type: "by",
          },
          {
            colName: "job_name",
            type: "by",
          },
          {
            colName: "end_time",
            type: "by",
          },
          {
            colName: "start_time",
            type: "by",
          },
        ],
        order: [
          {
            colName: "input_record_count",
            orderType: "desc",
          },
        ],
      };
      let url = this.getServiceUrl("select", params.serviceName, "datacenter");
      this.axios({
        method: "POST",
        url: url,
        data: params,
      })
        .then((res) => {
          let old = res.data.data;
          old.forEach((simple) => {
            if (name === simple.job_name) {
              NewStep.push(simple);
            }
          });
          this.step = NewStep;

          this.taskNo = this.step[0].job_no;
          this.getNewTask(this.taskNo);
          // this.taskName = res.data.data
          // let no = res.data.data[0].job_no
          // this.taskNo = no
        })
        .catch((err) => {});
    },
    getNewTask(str) {
      let params = {
        serviceName: "srvetl_processor_history_select",
        colNames: ["*"],
        condition: [
          {
            colName: "job_no",
            ruleType: "eq",
            value: str,
          },
        ],
      };
      let url = this.getServiceUrl("select", params.serviceName, "datacenter");
      this.axios({
        method: "POST",
        url: url,
        data: params,
      })
        .then((res) => {
          this.GanttData = res.data.data;

          // this.taskNo = res.data.data[0].job_no
        })
        .catch((err) => {});
    },
    getRightTask() {
      let params = {
        serviceName: "srvetl_job_history_select",
        colNames: ["*"],
        condition: [],
        group: [
          {
            colName: "job_name",
            type: "by",
          },
          {
            colName: "job_no",
            type: "by",
          },
        ],
        order: [
          {
            colName: "input_record_count",
            orderType: "desc",
          },
        ],
      };
      let url = this.getServiceUrl("select", params.serviceName, "datacenter");
      this.axios({
        method: "POST",
        url: url,
        data: params,
      })
        .then((res) => {
          this.taskName = res.data.data;
          let no = res.data.data[0].job_no;
          this.taskNo = no;
        })
        .catch((err) => {});
    },
    // getTaskList(num){
    //   let params = {
    //     "serviceName": "srvetl_processor_history_select",
    //     "colNames": ["*"],
    //     "condition": [
    //       {
    //         colName:"job_no",
    //         ruleType:"eq",
    //         value:num
    //       }
    //     ],
    //   }
    //    let url = this.getServiceUrl("select", params.serviceName, "datacenter")
    //     this.axios({
    //         method:"POST",url:url,data:params
    //       }
    //     )
    //     .then(res => {
    //       this.GanttData = res.data.data
    //     })
    //     .catch(err => {

    //     });
    // },

    getTaskAll() {},
    toManangerment() {
      let str = window.location.href;
      let num = str.indexOf("?");
      str = str.substr(num + 1);

      window.location.href = "../../main/index.html?" + str;
    },
  },

  props: ["checkDataType"],
  updated() {},
  mounted() {
    this.getRightTask();
    setTimeout(() => {
      this.getNewTask(this.taskNo);
    }, 1000);
    // this.getChartData(this.checkDataType)
    this.getChartData(this.checkDataType);
  },
  watch: {
    checkDataType: {
      handler(newValue, oldValue) {
        this.getChartData(this.checkDataType);

        this.getPieData(this.checkDataType);
      },
      deep: true,
    },
  },
};
</script>

<style lang="scss" scoped>
.big-title {
  padding: 0 20px;
  text-align: center;
  line-height: 50px;
  font-size: 1.2rem;
}
.last {
  display: flex;
  justify-content: flex-end;
  span {
    margin-right: 1rem;
    cursor: pointer;
    &:hover {
      text-decoration: underline;
    }
  }
}
.gantt_task {
  display: flex;
  margin-bottom: 1rem;
  margin-top: 1rem;
  span {
    // margin-left: 1rem;
    padding-right: 1rem;
    background-color: #47acff;
    padding: 4px;
    text-align: center;
    color: #fff;
    border-right: 1px solid rgb(17, 44, 194);
    &:last-child {
      border-right: 0;
    }
    cursor: pointer;
  }
}
$br-color: #4b93ff78;
$bg-color: #ed795a;
$text-color: #47acff;

.databox_three {
  width: 100%;
  height: 100%;

  padding: 1rem;
  box-sizing: border-box;
  //   background: url("../assets/images/panel-r-b.png") no-repeat;
  background-size: 100% 100%;
  // border:1px solid #fff;
  .databox_three_content {
    border: 1px solid $br-color;
  }
  .databox_three_top {
    line-height: 1.8rem;
    text-align: center;
    font-size: 1.5rem;
  }

  .databox_three_contentheader {
    > .databox-col {
      font-weight: bold;
      color: $text-color;
    }
  }

  .databox_three_contentheader,
  .databox-three-contentdata-view {
    display: flex;
    flex-direction: row;
    padding: 5px 0;
    align-items: center;
    box-sizing: border-box;
    border-bottom: 1px solid $br-color;
    line-height: 1rem;
    > .databox-col {
      width: 14.2%;
      font-size: 0.8rem;
      display: flex;
      flex-direction: row;
      justify-content: center;
      align-items: center;
      border-right: 1px solid $br-color;
      text-align: center;
      word-break: break-all;
      //   overflow: hidden;/*超出部分隐藏*/
      // text-overflow:ellipsis;/* 超出部分显示省略号 */
      // white-space: nowrap;/*规定段落中的文本不进行换行 */
      img {
        width: 2.8rem;
      }
      &:last-child {
        border-right: 0;
      }
    }
  }

  .databox-three-contentdata-view:last-child {
    border-width: 0;
  }
}
@media screen and (max-width: 1366px) {
  .databox-col {
    font-size: 0.3rem;
  }
  .gantt_task span {
    padding-right: 1rem;
    background-color: #47acff;
    padding: 4px;
    text-align: center;
    font-size: 0.4rem;
    color: #fff;
    border-right: 1px solid #112cc2;
    cursor: pointer;
  }
  .databox_three .databox_three_contentheader > .databox-col,
  .databox_three .databox-three-contentdata-view > .databox-col {
    font-size: 0.4rem;
    line-height: 0.8rem;
  }
}
</style>